#### Terragrunt Format and Style 🖌`success`
#### Terragrunt Initialization ⚙️`success`
#### Terragrunt Plan 📖`success`
#### Terragrunt Validation 🤖`success`

<details><summary>Show Plan</summary>

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_route53_zone.this["thesamcro.com"] will be created
  + resource "aws_route53_zone" "this" {
      + arn                 = (known after apply)
      + comment             = "Purchased from GoDaddy. Expires on 21/04/2023"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "thesamcro.com"
      + name_servers        = (known after apply)
      + primary_name_server = (known after apply)
      + tags                = {
          + "Name" = "thesamcro.com"
        }
      + tags_all            = {
          + "Environment" = "Development"
          + "Name"        = "thesamcro.com"
          + "OwnerEmail"  = "ilya.melnik.svc@gmail.com"
          + "Team"        = "Infraops"
          + "Terraform"   = "true"
        }
      + zone_id             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + route53_zone_name         = {
      + "thesamcro.com" = "thesamcro.com"
    }
  + route53_zone_name_servers = {
      + "thesamcro.com" = (known after apply)
    }
  + route53_zone_zone_arn     = {
      + "thesamcro.com" = (known after apply)
    }
  + route53_zone_zone_id      = {
      + "thesamcro.com" = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @obstaclex, Action: `pull_request`, Working Directory: `dev`, Workflow: `Terragrunt CI/CD Pipeline`*